In [5]:
# Merge, Join and concatenate in Pandas
import pandas as pd
data1 ={'Emp Id':['E01','E02','E03','E04','E05'],
       'Name':['Aman','Nikhil','Jayent','Kushagra','Rahul'],
       'Age':[20,22,21,23,25]}
data2 ={'Emp Id':['E01','E02','E03','E04','E05'],
       'Salary':[40000,56000,34000,30000,50000]}
d1 =pd.DataFrame(data1)
d2 =pd.DataFrame(data2)
print(d1)
print()
print(d2)

  Emp Id      Name  Age
0    E01      Aman   20
1    E02    Nikhil   22
2    E03    Jayent   21
3    E04  Kushagra   23
4    E05     Rahul   25

  Emp Id  Salary
0    E01   40000
1    E02   56000
2    E03   34000
3    E04   30000
4    E05   50000

In [9]:
# Employee Id based on data merge:

print(pd.merge(d1,d2,on ='Emp Id'))

  Emp Id      Name  Age  Salary
0    E01      Aman   20   40000
1    E02    Nikhil   22   56000
2    E03    Jayent   21   34000
3    E04  Kushagra   23   30000
4    E05     Rahul   25   50000

In [18]:
data3 ={'Emp Id':['E01','E02','E03','E04','E05'],
       'Name':['Aman','Nikhil','Jayent','Kushagra','Rahul'],
       'Age':[20,22,21,23,25]}
data4 ={'Emp Id':['E01','E02','E08','E09','E05'],
       'Salary':[40000,56000,34000,30000,50000]}
d3 =pd.DataFrame(data3)
d4 =pd.DataFrame(data4)

print(pd.merge(d3,d4, on = 'Emp Id'))# only comn emp id data merge
print()
print()

# merge data based on left data
print(pd.merge(left =d3,right =d4,on ='Emp Id',how ='left'))

  Emp Id    Name  Age  Salary
0    E01    Aman   20   40000
1    E02  Nikhil   22   56000
2    E05   Rahul   25   50000


  Emp Id      Name  Age   Salary
0    E01      Aman   20  40000.0
1    E02    Nikhil   22  56000.0
2    E03    Jayent   21      NaN
3    E04  Kushagra   23      NaN
4    E05     Rahul   25  50000.0

In [19]:
# merge data based on Right data
print(pd.merge(left =d3,right =d4,on ='Emp Id',how ='right'))

  Emp Id    Name   Age  Salary
0    E01    Aman  20.0   40000
1    E02  Nikhil  22.0   56000
2    E08     NaN   NaN   34000
3    E09     NaN   NaN   30000
4    E05   Rahul  25.0   50000

In [31]:
# join function

data5 ={'Emp Id':['E01','E02','E03','E04','E05'],
       'Name':['Aman','Nikhil','Jayent','Kushagra','Rahul'],
       'Age':[20,22,21,23,25]}
data6 ={'Emp Id':['E11','E12','E13','E14','E15'],
        'Name':['Dipankar','Satyam','Rajendra','bhunesh','Shivam'],
        'Age':[21,26,28,18,19]}
       
d5 =pd.DataFrame(data5)
d6 =pd.DataFrame(data6)
#print(pd.join(d5,d6))

# combine data
print(pd.concat([d5,d6]))

  Emp Id      Name  Age
0    E01      Aman   20
1    E02    Nikhil   22
2    E03    Jayent   21
3    E04  Kushagra   23
4    E05     Rahul   25
0    E11  Dipankar   21
1    E12    Satyam   26
2    E13  Rajendra   28
3    E14   bhunesh   18
4    E15    Shivam   19